; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	image3 - mode
	infrared4 - mode
	thermograph0 - mode
	infrared2 - mode
	infrared1 - mode
	Star9 - direction
	Star10 - direction
	GroundStation13 - direction
	Star15 - direction
	Star16 - direction
	Star36 - direction
	Star42 - direction
	GroundStation45 - direction
	Star46 - direction
	GroundStation49 - direction
	Star30 - direction
	GroundStation4 - direction
	GroundStation44 - direction
	GroundStation18 - direction
	Star24 - direction
	GroundStation20 - direction
	GroundStation39 - direction
	GroundStation32 - direction
	GroundStation48 - direction
	GroundStation11 - direction
	Star23 - direction
	Star33 - direction
	Star25 - direction
	Star37 - direction
	Star12 - direction
	Star1 - direction
	Star38 - direction
	GroundStation7 - direction
	GroundStation26 - direction
	GroundStation35 - direction
	Star28 - direction
	GroundStation34 - direction
	Star40 - direction
	GroundStation8 - direction
	GroundStation47 - direction
	Star14 - direction
	Star3 - direction
	Star22 - direction
	Star0 - direction
	Star41 - direction
	GroundStation31 - direction
	GroundStation2 - direction
	Star5 - direction
	GroundStation17 - direction
	Star21 - direction
	GroundStation27 - direction
	Star43 - direction
	Star6 - direction
	Star19 - direction
	Star29 - direction
	Star50 - direction
	Phenomenon51 - direction
	Star52 - direction
	Phenomenon53 - direction
	Planet54 - direction
	Phenomenon55 - direction
	Star56 - direction
	Phenomenon57 - direction
	Star58 - direction
	Star59 - direction
	Planet60 - direction
	Star61 - direction
	Phenomenon62 - direction
	Phenomenon63 - direction
	Planet64 - direction
	Phenomenon65 - direction
	Star66 - direction
	Star67 - direction
	Star68 - direction
	Star69 - direction
	Phenomenon70 - direction
	Star71 - direction
	Planet72 - direction
	Planet73 - direction
	Phenomenon74 - direction
	Star75 - direction
	Star76 - direction
	Star77 - direction
	Phenomenon78 - direction
	Phenomenon79 - direction
	Planet80 - direction
	Planet81 - direction
	Phenomenon82 - direction
	Planet83 - direction
	Planet84 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 infrared1)
	(supports instrument0 infrared4)
	(calibration_target instrument0 Star30)
	(calibration_target instrument0 GroundStation47)
	(calibration_target instrument0 GroundStation27)
	(calibration_target instrument0 GroundStation39)
	(supports instrument1 infrared4)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation44)
	(calibration_target instrument1 GroundStation20)
	(calibration_target instrument1 GroundStation17)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation26)
	(calibration_target instrument1 Star24)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation39)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument3 infrared1)
	(supports instrument3 image3)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation17)
	(calibration_target instrument3 Star29)
	(calibration_target instrument3 GroundStation39)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation20)
	(calibration_target instrument3 Star25)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 Star40)
	(calibration_target instrument3 Star24)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 GroundStation18)
	(supports instrument4 infrared1)
	(supports instrument4 infrared2)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star43)
	(calibration_target instrument4 Star37)
	(calibration_target instrument4 Star25)
	(calibration_target instrument4 Star12)
	(calibration_target instrument4 Star33)
	(calibration_target instrument4 Star23)
	(calibration_target instrument4 GroundStation11)
	(calibration_target instrument4 GroundStation31)
	(calibration_target instrument4 Star21)
	(calibration_target instrument4 GroundStation47)
	(calibration_target instrument4 GroundStation34)
	(calibration_target instrument4 Star29)
	(calibration_target instrument4 GroundStation48)
	(calibration_target instrument4 GroundStation32)
	(supports instrument5 thermograph0)
	(supports instrument5 infrared4)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation8)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star75)
	(supports instrument6 image3)
	(supports instrument6 infrared4)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star12)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation27)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star14)
	(calibration_target instrument7 GroundStation47)
	(calibration_target instrument7 GroundStation8)
	(calibration_target instrument7 Star40)
	(calibration_target instrument7 GroundStation34)
	(calibration_target instrument7 Star6)
	(calibration_target instrument7 Star28)
	(calibration_target instrument7 GroundStation35)
	(calibration_target instrument7 GroundStation26)
	(calibration_target instrument7 GroundStation7)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 Star38)
	(calibration_target instrument7 Star1)
	(supports instrument8 image3)
	(calibration_target instrument8 GroundStation2)
	(calibration_target instrument8 GroundStation17)
	(calibration_target instrument8 GroundStation31)
	(calibration_target instrument8 Star41)
	(calibration_target instrument8 Star0)
	(calibration_target instrument8 Star22)
	(calibration_target instrument8 Star3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon74)
	(supports instrument9 infrared2)
	(calibration_target instrument9 Star29)
	(calibration_target instrument9 Star19)
	(calibration_target instrument9 Star6)
	(calibration_target instrument9 Star43)
	(calibration_target instrument9 GroundStation27)
	(calibration_target instrument9 Star21)
	(calibration_target instrument9 GroundStation17)
	(calibration_target instrument9 Star5)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star67)
)
(:goal (and
	(pointing satellite4 Star37)
	(have_image Star50 infrared2)
	(have_image Phenomenon51 infrared4)
	(have_image Star52 infrared2)
	(have_image Phenomenon53 infrared4)
	(have_image Planet54 infrared1)
	(have_image Phenomenon55 image3)
	(have_image Star56 infrared2)
	(have_image Phenomenon57 infrared4)
	(have_image Star58 image3)
	(have_image Star59 image3)
	(have_image Planet60 infrared4)
	(have_image Star61 image3)
	(have_image Phenomenon62 infrared2)
	(have_image Phenomenon63 image3)
	(have_image Planet64 image3)
	(have_image Phenomenon65 image3)
	(have_image Star66 infrared2)
	(have_image Star67 thermograph0)
	(have_image Star68 infrared4)
	(have_image Star69 thermograph0)
	(have_image Phenomenon70 thermograph0)
	(have_image Star71 image3)
	(have_image Planet72 image3)
	(have_image Planet73 infrared2)
	(have_image Phenomenon74 image3)
	(have_image Star75 infrared2)
	(have_image Star76 thermograph0)
	(have_image Star77 image3)
	(have_image Phenomenon78 infrared4)
	(have_image Phenomenon79 infrared4)
	(have_image Planet80 infrared4)
	(have_image Planet81 infrared2)
	(have_image Phenomenon82 infrared2)
	(have_image Planet83 infrared1)
	(have_image Planet84 image3)
))

)

; plan
1. (switch_on instrument9 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument9)
   goals met: 0 of 36
2. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 36
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 36
4. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 0 of 36
5. (turn_to satellite4 star37 star67)
   deleted: (pointing satellite4 star67)
   added: (pointing satellite4 star37)
   goals met: 1 of 36
6. (turn_to satellite0 phenomenon51 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon51)
   goals met: 1 of 36
7. (turn_to satellite3 star41 phenomenon74)
   deleted: (pointing satellite3 phenomenon74)
   added: (pointing satellite3 star41)
   goals met: 1 of 36
8. (calibrate satellite3 instrument8 star41)
   added: (calibrated instrument8)
   goals met: 1 of 36
9. (turn_to satellite3 phenomenon55 star41)
   deleted: (pointing satellite3 star41)
   added: (pointing satellite3 phenomenon55)
   goals met: 1 of 36
10. (take_image satellite3 phenomenon55 instrument8 image3)
   added: (have_image phenomenon55 image3)
   goals met: 2 of 36
11. (turn_to satellite3 phenomenon63 phenomenon55)
   deleted: (pointing satellite3 phenomenon55)
   added: (pointing satellite3 phenomenon63)
   goals met: 2 of 36
12. (take_image satellite3 phenomenon63 instrument8 image3)
   added: (have_image phenomenon63 image3)
   goals met: 3 of 36
13. (turn_to satellite3 phenomenon65 phenomenon63)
   deleted: (pointing satellite3 phenomenon63)
   added: (pointing satellite3 phenomenon65)
   goals met: 3 of 36
14. (take_image satellite3 phenomenon65 instrument8 image3)
   added: (have_image phenomenon65 image3)
   goals met: 4 of 36
15. (turn_to satellite3 phenomenon74 phenomenon65)
   deleted: (pointing satellite3 phenomenon65)
   added: (pointing satellite3 phenomenon74)
   goals met: 4 of 36
16. (take_image satellite3 phenomenon74 instrument8 image3)
   added: (have_image phenomenon74 image3)
   goals met: 5 of 36
17. (turn_to satellite3 planet64 phenomenon74)
   deleted: (pointing satellite3 phenomenon74)
   added: (pointing satellite3 planet64)
   goals met: 5 of 36
18. (take_image satellite3 planet64 instrument8 image3)
   added: (have_image planet64 image3)
   goals met: 6 of 36
19. (turn_to satellite3 planet72 planet64)
   deleted: (pointing satellite3 planet64)
   added: (pointing satellite3 planet72)
   goals met: 6 of 36
20. (take_image satellite3 planet72 instrument8 image3)
   added: (have_image planet72 image3)
   goals met: 7 of 36
21. (turn_to satellite3 planet84 planet72)
   deleted: (pointing satellite3 planet72)
   added: (pointing satellite3 planet84)
   goals met: 7 of 36
22. (take_image satellite3 planet84 instrument8 image3)
   added: (have_image planet84 image3)
   goals met: 8 of 36
23. (turn_to satellite3 star58 planet84)
   deleted: (pointing satellite3 planet84)
   added: (pointing satellite3 star58)
   goals met: 8 of 36
24. (take_image satellite3 star58 instrument8 image3)
   added: (have_image star58 image3)
   goals met: 9 of 36
25. (turn_to satellite3 star59 star58)
   deleted: (pointing satellite3 star58)
   added: (pointing satellite3 star59)
   goals met: 9 of 36
26. (take_image satellite3 star59 instrument8 image3)
   added: (have_image star59 image3)
   goals met: 10 of 36
27. (turn_to satellite3 star61 star59)
   deleted: (pointing satellite3 star59)
   added: (pointing satellite3 star61)
   goals met: 10 of 36
28. (take_image satellite3 star61 instrument8 image3)
   added: (have_image star61 image3)
   goals met: 11 of 36
29. (turn_to satellite3 star71 star61)
   deleted: (pointing satellite3 star61)
   added: (pointing satellite3 star71)
   goals met: 11 of 36
30. (take_image satellite3 star71 instrument8 image3)
   added: (have_image star71 image3)
   goals met: 12 of 36
31. (turn_to satellite3 star77 star71)
   deleted: (pointing satellite3 star71)
   added: (pointing satellite3 star77)
   goals met: 12 of 36
32. (take_image satellite3 star77 instrument8 image3)
   added: (have_image star77 image3)
   goals met: 13 of 36
33. (turn_to satellite1 phenomenon70 star75)
   deleted: (pointing satellite1 star75)
   added: (pointing satellite1 phenomenon70)
   goals met: 13 of 36
34. (turn_to satellite0 star30 phenomenon51)
   deleted: (pointing satellite0 phenomenon51)
   added: (pointing satellite0 star30)
   goals met: 13 of 36
35. (calibrate satellite0 instrument0 star30)
   added: (calibrated instrument0)
   goals met: 13 of 36
36. (turn_to satellite0 phenomenon51 star30)
   deleted: (pointing satellite0 star30)
   added: (pointing satellite0 phenomenon51)
   goals met: 13 of 36
37. (take_image satellite0 phenomenon51 instrument0 infrared4)
   added: (have_image phenomenon51 infrared4)
   goals met: 14 of 36
38. (turn_to satellite0 phenomenon53 phenomenon51)
   deleted: (pointing satellite0 phenomenon51)
   added: (pointing satellite0 phenomenon53)
   goals met: 14 of 36
39. (take_image satellite0 phenomenon53 instrument0 infrared4)
   added: (have_image phenomenon53 infrared4)
   goals met: 15 of 36
40. (turn_to satellite0 phenomenon57 phenomenon53)
   deleted: (pointing satellite0 phenomenon53)
   added: (pointing satellite0 phenomenon57)
   goals met: 15 of 36
41. (take_image satellite0 phenomenon57 instrument0 infrared4)
   added: (have_image phenomenon57 infrared4)
   goals met: 16 of 36
42. (turn_to satellite0 phenomenon62 phenomenon57)
   deleted: (pointing satellite0 phenomenon57)
   added: (pointing satellite0 phenomenon62)
   goals met: 16 of 36
43. (take_image satellite0 phenomenon62 instrument0 infrared2)
   added: (have_image phenomenon62 infrared2)
   goals met: 17 of 36
44. (turn_to satellite0 phenomenon78 phenomenon62)
   deleted: (pointing satellite0 phenomenon62)
   added: (pointing satellite0 phenomenon78)
   goals met: 17 of 36
45. (take_image satellite0 phenomenon78 instrument0 infrared4)
   added: (have_image phenomenon78 infrared4)
   goals met: 18 of 36
46. (turn_to satellite0 phenomenon79 phenomenon78)
   deleted: (pointing satellite0 phenomenon78)
   added: (pointing satellite0 phenomenon79)
   goals met: 18 of 36
47. (take_image satellite0 phenomenon79 instrument0 infrared4)
   added: (have_image phenomenon79 infrared4)
   goals met: 19 of 36
48. (turn_to satellite0 phenomenon82 phenomenon79)
   deleted: (pointing satellite0 phenomenon79)
   added: (pointing satellite0 phenomenon82)
   goals met: 19 of 36
49. (take_image satellite0 phenomenon82 instrument0 infrared2)
   added: (have_image phenomenon82 infrared2)
   goals met: 20 of 36
50. (turn_to satellite0 planet54 phenomenon82)
   deleted: (pointing satellite0 phenomenon82)
   added: (pointing satellite0 planet54)
   goals met: 20 of 36
51. (take_image satellite0 planet54 instrument0 infrared1)
   added: (have_image planet54 infrared1)
   goals met: 21 of 36
52. (turn_to satellite0 planet60 planet54)
   deleted: (pointing satellite0 planet54)
   added: (pointing satellite0 planet60)
   goals met: 21 of 36
53. (take_image satellite0 planet60 instrument0 infrared4)
   added: (have_image planet60 infrared4)
   goals met: 22 of 36
54. (turn_to satellite0 planet73 planet60)
   deleted: (pointing satellite0 planet60)
   added: (pointing satellite0 planet73)
   goals met: 22 of 36
55. (take_image satellite0 planet73 instrument0 infrared2)
   added: (have_image planet73 infrared2)
   goals met: 23 of 36
56. (turn_to satellite0 planet80 planet73)
   deleted: (pointing satellite0 planet73)
   added: (pointing satellite0 planet80)
   goals met: 23 of 36
57. (take_image satellite0 planet80 instrument0 infrared4)
   added: (have_image planet80 infrared4)
   goals met: 24 of 36
58. (turn_to satellite0 planet81 planet80)
   deleted: (pointing satellite0 planet80)
   added: (pointing satellite0 planet81)
   goals met: 24 of 36
59. (take_image satellite0 planet81 instrument0 infrared2)
   added: (have_image planet81 infrared2)
   goals met: 25 of 36
60. (turn_to satellite0 planet83 planet81)
   deleted: (pointing satellite0 planet81)
   added: (pointing satellite0 planet83)
   goals met: 25 of 36
61. (take_image satellite0 planet83 instrument0 infrared1)
   added: (have_image planet83 infrared1)
   goals met: 26 of 36
62. (turn_to satellite0 star50 planet83)
   deleted: (pointing satellite0 planet83)
   added: (pointing satellite0 star50)
   goals met: 26 of 36
63. (take_image satellite0 star50 instrument0 infrared2)
   added: (have_image star50 infrared2)
   goals met: 27 of 36
64. (turn_to satellite0 star52 star50)
   deleted: (pointing satellite0 star50)
   added: (pointing satellite0 star52)
   goals met: 27 of 36
65. (take_image satellite0 star52 instrument0 infrared2)
   added: (have_image star52 infrared2)
   goals met: 28 of 36
66. (turn_to satellite0 star56 star52)
   deleted: (pointing satellite0 star52)
   added: (pointing satellite0 star56)
   goals met: 28 of 36
67. (take_image satellite0 star56 instrument0 infrared2)
   added: (have_image star56 infrared2)
   goals met: 29 of 36
68. (turn_to satellite0 star66 star56)
   deleted: (pointing satellite0 star56)
   added: (pointing satellite0 star66)
   goals met: 29 of 36
69. (take_image satellite0 star66 instrument0 infrared2)
   added: (have_image star66 infrared2)
   goals met: 30 of 36
70. (turn_to satellite0 star68 star66)
   deleted: (pointing satellite0 star66)
   added: (pointing satellite0 star68)
   goals met: 30 of 36
71. (take_image satellite0 star68 instrument0 infrared4)
   added: (have_image star68 infrared4)
   goals met: 31 of 36
72. (turn_to satellite0 star75 star68)
   deleted: (pointing satellite0 star68)
   added: (pointing satellite0 star75)
   goals met: 31 of 36
73. (take_image satellite0 star75 instrument0 infrared2)
   added: (have_image star75 infrared2)
   goals met: 32 of 36
74. (turn_to satellite1 groundstation8 phenomenon70)
   deleted: (pointing satellite1 phenomenon70)
   added: (pointing satellite1 groundstation8)
   goals met: 32 of 36
75. (calibrate satellite1 instrument5 groundstation8)
   added: (calibrated instrument5)
   goals met: 32 of 36
76. (turn_to satellite1 phenomenon70 groundstation8)
   deleted: (pointing satellite1 groundstation8)
   added: (pointing satellite1 phenomenon70)
   goals met: 32 of 36
77. (take_image satellite1 phenomenon70 instrument5 thermograph0)
   added: (have_image phenomenon70 thermograph0)
   goals met: 33 of 36
78. (turn_to satellite1 star67 phenomenon70)
   deleted: (pointing satellite1 phenomenon70)
   added: (pointing satellite1 star67)
   goals met: 33 of 36
79. (take_image satellite1 star67 instrument5 thermograph0)
   added: (have_image star67 thermograph0)
   goals met: 34 of 36
80. (turn_to satellite1 star69 star67)
   deleted: (pointing satellite1 star67)
   added: (pointing satellite1 star69)
   goals met: 34 of 36
81. (take_image satellite1 star69 instrument5 thermograph0)
   added: (have_image star69 thermograph0)
   goals met: 35 of 36
82. (turn_to satellite1 star76 star69)
   deleted: (pointing satellite1 star69)
   added: (pointing satellite1 star76)
   goals met: 35 of 36
83. (take_image satellite1 star76 instrument5 thermograph0)
   added: (have_image star76 thermograph0)
   goals met: 36 of 36
